target/test-classes/soap-config.yml

# SOAP Performance Test Configuration

protocol: soap

execution:
  threads: 2
  iterations: 3
  rampUpSeconds: 1
  holdSeconds: 2

request:
  name: "Number Conversion Test"
  endpoint: "https://www.dataaccess.com/webservicesserver/NumberConversion.wso"
  method: "POST"
  soapAction: "https://www.dataaccess.com/webservicesserver/NumberToWords"
  xmlBody: |
    <?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Body>
        <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
          <ubiNum>42</ubiNum>
        </NumberToWords>
      </soap:Body>
    </soap:Envelope>

templates:
  bodyPath: "templates/soap/body/number_to_words.xml"
  headersPath: "templates/soap/headers/default_headers.json"
